Revit 2027 API
StairsRun.GetConnections Method
 Returns information about the connections in which the stairs run participates. The stairs run may have no connection, or have at maximum two connections at the lower and upper ends.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<StairsComponentConnection> GetConnections()
Public Function GetConnections As IList(Of StairsComponentConnection)
public:
IList<StairsComponentConnection^>^ GetConnections()
member GetConnections : unit -> IList<StairsComponentConnection>
Return Value
IList<StairsComponentConnection>
 The connections in which the stairs run participates.
See Also
Reference
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace